"notes": "LIVE TESTING SUMMARY (2026):\n----------------------------\nAverage Solana Withdrawal: 14s\nAverage Bitcoin Withdrawal: 4.2m\nMost VPN-Friendly: Bitsler, Duel\nKYC Risk Level: Low (unless >$5k USD)\nAll nodes verified by WagerX Archive.",
  "rtp": "RTP (Return to Player) is the % of wagered money a game pays back over time. WagerX recommends slots with 96%+ RTP for long-term sustainability.",
  "house edge": "The casino's mathematical advantage. A 1% house edge means the house expects to keep $1 for every $100 bet. Always look for low-edge 'Originals'.",
  "provably fair": "A blockchain system allowing you to verify every bet's fairness using cryptographic seeds. It proves the casino didn't 'cheat' the result.",
  "kyc": "Know Your Customer. Process where casinos verify your identity. WagerX audits focus on 'No-KYC' sites that allow anonymous play via crypto.",
  "wagering": "Also called 'Rollover'. The amount you must bet before withdrawing bonus funds. (e.g., 10x wagering on $100 = $1,000 total bets required).",
  "faucet": "A feature where casinos give away tiny amounts of free crypto (e.g., Satoshi) so you can test games for free without a deposit.",
  "rekt": "Crypto-slang for 'Wrecked'. It means suffering a massive loss, usually by over-leveraging or chasing losses. Stay safe and bet small!",
  "degen": "Short for 'Degenerate'. A high-risk player who loves volatility and experimental games. WagerX is built for degens who want transparency.",
  "whale": "A high-stakes player who bets massive volumes. Whales get the best VIP perks, including dedicated hosts and instant 20%+ cashback.",
  "moon": "When a coin or a multiplier hits a massive peak. 'To the moon!' refers to chasing those 1000x+ hits on games like Crash or Limbo.",
  "wagmi": "'We Are Gonna Make It'. An optimistic rally cry in the crypto community used when a platform pays out big or a project succeeds.",
  "ngmi": "'Not Gonna Make It'. Used when someone makes a bad bet, panics, or uses a non-verified, shady casino. Don't be NGMI—use audited sites.",
  "dca": "Dollar Cost Averaging. A strategy where you deposit fixed amounts at regular intervals rather than one big 'all-in' bet. Great for bankroll management."
}
